<HTML>
<head>
	<title>Mathias Dezitter</title>
	<link rel="stylesheet" href="page.css" />
</head>
<body>
<div class="top">
	<div class="titre_div">
		<HR class="sep"></HR>
		<p class="wtitre"><g>Dezitter Mathias</g></p>
		<p class="wtitre_sub">Etudiant &agrave; 42.
		<p class="wtitre_sub">D&eacute;veloppeur</p>
		<HR class="sep"></HR>
	</div>
	<div class="content">
		<p class="wtitre_sub">Langage C</p>
		<p class="listing">- D&eacute;veloppement d'un shell type Bash au complet.</p>
		<p class="listing">- Recode de la commande LS avec flag.</p>
		<p class="listing">- D&eacute;veloppement d'un programme de s&eacute;lection a l'aide des Termcaps.</p>
		<p class="listing">- Recode de printf (conversions : sSpdDioOuUxXcC).</p>
		<p class="listing">- D&eacute;veloppement d'un programme ayant pour but les diff&eacute;rents types de tri existant.</p>
		<p class="listing">- D&eacute;veloppement d'un programme utilisant le brute force pour r&eacute;soudre une probl&eacute;matique.</p>
		<p class="listing">- D&eacute;veloppement d'une IA de puissance 4 utilisant l'algorithme de Minimax (Negamax).</p>
		<p class="listing">- Recode du jeu 2048.</p>
		<p class="listing">- D&eacute;veloppement d'une repr&eacute;sentation en vue isom&eacute;trique de differentes formes.</p>
		<p class="listing">- D&eacute;veloppement d'une repr&eacute;sentation du plusieurs fractals (Julia, Mandelbrot, Burning ship ...).</p>
		<p class="listing">- D&eacute;veloppement d'un jeu de labyrinthe 3D avec la technique de raycast.</p>
		<p class="listing">- Cr&eacute;ation d'une biblioth&egrave;que personnelle.</p>
		<br/>
		<HR class="sep"></HR>
		<p class="wtitre_sub">Unity et C#</p>
		<p class="listing">- Recode de jeu simple (Pong, flappy bird).</p>
		<p class="listing">- Recode d'un Hotline Miami.</p>
		<p class="listing">- D&eacute;veloppement d'un d&eacute;but de jeu type Hack'n slash.</p>
		<p class="listing">- D&eacute;veloppement de divers petits jeux, utilisant la 3D dans le cadre d'apprentissages.</p>
		<br/>
		<HR class="sep"></HR>
		<p class="wtitre_sub">Programation objet</p>
		<p class="listing">- D&eacute;veloppement d'un jeu type Space invader en C++.</p>
		<p class="listing">- D&eacute;veloppement d'un outil de gestion des taches et performance informatique en C++ et QT.</p>
		<p class="listing">- D&eacute;veloppement d'un programme de trajet de m&eacute;tro (algorithme de Dijkstra) en python.</p>
		<br/>
		<HR class="sep"></HR>
		<p class="wtitre_sub">Securit&eacute; et Assembleur</p>
		<p class="listing">- Cr&eacute;ation d'une biblioth&egrave;que personnelle en assembleur utilisable par le C.</p>
		<p class="listing">- R&eacute;solution de divers challenges de s&eacute;curite (syst&egrave;me, cracking) sur le site root-me.</p>
		<br/>
		<HR class="sep"></HR>
		<p class="wtitre_sub">Web et application</p>
		<p class="listing">- D&eacute;veloppement d'une application de messagerie / contact pour android (JAVA).</p>
		<p class="listing">- D&eacute;veloppement d'un site de E-commerce en local pour apprendre le syst&egrave;me MVC sous Symfony2.</p>
		<p class="listing">- D&eacute;veloppement d'un site de montage avec interaction de la webcam sans framework en PHP.</p>
		<HR class="sep"></HR>
		<br/>
		<br/>
		<p class="listing">Pour me contacter : mdezitte@student.42.fr ou 0645555121.</p>
		<br/>
		<br/>
	</div>
</div>
</body>
<footer>
	
</footer>
</HTML>
